---
kind: property
id: P:Autodesk.Revit.DB.GenericImportOptions.RefPoint
source: html/6acca39c-09fe-6e40-635f-31e790ad0102.htm
---
# Autodesk.Revit.DB.GenericImportOptions.RefPoint Property

Reference point (in Revit) to which the image is going to be inserted.

## Syntax (C#)
```csharp
public XYZ RefPoint { get; set; }
```

## Remarks
If Nothing nullptr a null reference ( Nothing in Visual Basic) , the image will be inserted to the Revit's origin.